<?php
class Ext_Common_Translit
{
  /**
   * Таблица перекодировки
   * @var <array>
   */
  static $transliteration_table = array(
    'а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd', 'е' => 'e', 'ж' => 'g',
    'з' => 'z', 'и' => 'i', 'й' => 'y', 'к' => 'k', 'л' => 'l', 'м' => 'm', 'н' => 'n',
    'о' => 'o', 'п' => 'p', 'р' => 'r', 'с' => 's', 'т' => 't', 'у' => 'u', 'ф' => 'f',
    'ы' => 'i', 'э' => 'e', 'А' => 'a', 'Б' => 'b', 'В' => 'v', 'Г' => 'g', 'Д' => 'd',
    'Е' => 'e', 'Ж' => 'g', 'З' => 'z', 'И' => 'i', 'Й' => 'y', 'К' => 'k', 'Л' => 'l',
    'М' => 'm', 'Н' => 'n', 'О' => 'o', 'П' => 'p', 'Р' => 'r', 'С' => 's', 'Т' => 't',
    'У' => 'u', 'Ф' => 'f', 'Ы' => 'i', 'Э' => 'e', 'ё' => 'yo', 'х' => 'h', 'ц' => 'ts',
    'ч' => 'ch', 'ш' => 'sh', 'щ' => 'shch', 'ъ' => '', 'ь' => '', 'ю' => 'yu', 'я' => 'ya',
    'Ё' => 'yo', 'Х' => 'h', 'Ц' => 'ts', 'Ч' => 'ch', 'Ш' => 'sh', 'Щ' => 'shch', 'Ъ' => '',
    'Ь' => '', 'Ю' => 'yu', 'Я' => 'ya', ' ' => '-'
  );

  /**
   * Транслитерация строки
   * @param <string> $string
   * @return <string>
   */
  public static function transliterate( $string )
  {
    return strtr( $string, self::$transliteration_table );
  }
}
